Repository: Slipfaith/tmragger
Catalog: sample-tmx/HW_Marketing_en-US_pt-PT_repaired.tmx
Source language: en_us
Languages: pt_pt

source: To find it, look for a big chest while exploring all available paths on the location Good luck!
pt_pt: Para a encontrares, procura um baú grande quando estiveres a explorar todos os caminhos possíveis do local Boa sorte!

source: Noble heroes await your orders.
pt_pt: Heróis valentes esperam por ti.

source: Play now to collect and upgrade valiant fighters.
pt_pt: Joga já, obtém e melhora os mais corajosos combatentes.

source: Battle-test all the Titans, including the newcomer, Mort, to find the best winning strategies and get cool rewards!
pt_pt: Testa todos os titãs em combate (até o recém chegado Mort), cria uma estratégia vencedora e ganha recompensas!

source: LONG LIVE THE KING!
pt_pt: VIVA O REI!

source: Refresh the look of Mushy & Shroom, Morrigan, and Corvus to improve their combat capabilities!
pt_pt: Dá um novo ar a Mushy e Shroom, Morrigan e Corvus, e melhora as suas capacidades em combate!

source: The Dominion is about to become one titanically massive battlefield! Titans of every class and element will fight to prove their might, and it's up to you to determine the strongest ones. Battle-test all of them, including the newcomer, Mort, to find the best winning strategies! Plan ahead and use your experience to claim a plethora of prizes that will help you make your Titan teams even better.
pt_pt: O Domínio está prestes a tornar-se um campo de batalha titânico! Titãs de todas as classes e elemento querem mostrar o que valem em combate. Cabe-te a ti descobrir os mais fortes. Testa todos os titãs em combate (até o recém chegado Mort) e cria uma estratégia vencedora! Planeia bem e ganha prémios para melhorar ainda mais as tuas equipas de titãs!

source: It's time to redress an injustice!
pt_pt: Está na altura de lidar com uma injustiça!

source: Help Isaac, Orion, and Aidan finally obtain their first Talismans!
pt_pt: Ajuda Isaac, Orion e Aidan a obterem finalmente os seus primeiros Talismãs!

source: It's only fair, since the other Guardians already have theirs.
pt_pt: É uma questão de justiça, considerando que os outros já têm os seus.

source: This event also gives you the chance to get Dante, Heidi, and Chabba a second Talisman each, as well as earn resources to upgrade these handy artifacts!
pt_pt: Este evento também te dá a oportunidade de obter os segundos Talismãs para Dante, Heidi e Chabba, assim como ganhar recursos para melhorar estes artefactos!

source: Grant unimaginable power to your favorite Heroes!
pt_pt: Concede poder inimaginável aos teus Heróis preferidos!

source: Hello there! You can get more Dynamite in exchange for gems. Just tap on the Dynamite icon to do that :) Yet, we may add Dynamite as a reward in different game activities in the future. Stay tuned!
pt_pt: Olá! Podes receber Dinamite em troca de joias. Só tens de tocar no ícone da Dinamite :) No entanto, poderemos adicionar Dinamite como recompensa em diferentes atividades no futuro. Fica de olhos nas novidades!

source: An update worth its weight in gold!
pt_pt: Uma atualização que vale o peso em ouro!

source: Luther's Buff Luther's golden armor now does a better job protecting him from magic, and he can charge into the enemy backline without accumulating energy!
pt_pt: Vantagem do Luther Agora a armadura dourada do Luther protege-o melhor de magia e permite-lhe fazer investidas para a retaguarda inimiga sem acumular energia!

source: Hero's Way Shop Collect special coins on Hero's Way and spend them in the new shop.
pt_pt: Loja Caminho do Herói Obtém moedas especiais no Caminho do Herói e gasta-as na loja.

source: New Skins Check out the new collection of clothes in red and gold, as well as new romantic outfits!
pt_pt: Novos visuais Espreita a nova coleção de roupa em tons vermelhos e dourados, e os novos trajes românticos!

source: VIP Offer Starting at VIP-5, players will get a daily special bundle offer in the VIP shop.
pt_pt: Oferta VIP A partir do VIP-5 recebes conjuntos diários incríveis na loja VIP.

source: Time to shine!
pt_pt: Destaca-te!

source: Let's celebrate together!
pt_pt: Vamos celebrar!

source: Grow a Winterfest tree, take part in thrilling activities and get lots of presents!
pt_pt: Planta uma Árvore do Festival de Inverno, participa nas atividades e ganha presentes!

source: A bountiful harvest of interesting events awaits in September!
pt_pt: Há eventos fantásticos à tua espera para setembro!

source: Grow the tallest tree with your Guild and check out the Autumn Festival for a valuable tankard of prizes and Titan resources!
pt_pt: Junta-te à tua guilda para criar a árvore mais alta e não percas o Festival de Outono, montes de prémios e recursos para Titãs!

source: Fill up your collection with new Demonic Skins and don’t miss out on Titan updates!
pt_pt: Acrescenta os novos visuais Demoníacos à tua coleção e não percas os Titãs atualizados!

source: You should also take a look at the premium pass to get as many useful resources as possible, plus the Grand Prizes: Xe’Sha’s Sea Skin, a Soleil avatar, and a stylish frame!
pt_pt: Também podes aproveitar o passe premium para obter mais recursos e os Grandes Prémios: um visual marítimo para Xe’Sha, um avatar de Soleil e uma moldura porreira!

source: Entertainments to suit any tastes!
pt_pt: Há algo para todos!

source: We don't have such a feature in the game just yet.
pt_pt: O jogo não tem essa funcionalidade.

source: Still, we're constantly improving the game, so something like this may appear in Island Questaway in the future ;) Stay tuned!
pt_pt: No entanto, estamos constantemente a melhorar, por isso, algo semelhante poderá surgir no Island Questaway no futuro ;) Fica de olho nas novidades!

source: It's getting warmer and warmer outside; time to dress up your favorite Heroes! Take part in the new spring event with striking outfits for Orion, K'arkh, and Keira! Complete challenges, earn rewards, and upgrade Orion's Skin even more!
pt_pt: O tempo já começa a aquecer! Está na hora de trocar a roupa aos teus heróis favoritos! Participa no novo evento de Primavera com os novos visuais para Orion, K'arkh e Keira! Conclui desafios, ganha recompensas e melhora ainda mais o visual de Orion!

source: This update will send shivers down your spine! Tales of the Nightmare Valley What sorcery is this? Help out a new hero, defeat the Pumpkin King, and earn rewards! It’s in the Bag! The new Nature Hero is an entire fungal hivemind with a single consciousness - a fearsome ally, no doubt! Hellish Transformation Qing Mao, Mojo, and Faceless are getting Demonic Skins, and Faceless’s skin can be upgraded to improve his stats and make him more fearsome than ever! Terrify the enemy!
pt_pt: Até vais tremer com esta atualização! Contos do Vale dos Pesadelos Que magia é esta? Ajuda um novo herói, derrota o Rei Abóbora e ganha recompensas! É canja! O novo herói da Natureza é uma colónia fúngica com uma mente coletiva, um aliado temível! Transformação infernal! Qing Mao, Mojo e Sem Rosto recebem Visuais Demoníacos. Podes melhorar o visual do Sem Rosto para lhe dar melhores atributos e o tornar mais poderoso do que nunca! Aterroriza os teus inimigos!

source: Lara Croft is in Dominion!
pt_pt: Lara Croft chegou ao Domínio!

source: Be a part of a Guild, fight alongside a league of other heroes, and share your prize.
pt_pt: Entra numa Guilda, luta junto duma liga de outros heróis e partilha os prémios.

source: We're rolling out a terrific update! Demonic sale The new skins for K'arkh, Satori, and Phobos are enough to make sea monsters sick with envy. Grab them at a discount! Open borders You can now freely transfer your account to another server as long as it was created before your original server! Go on, dive headfirst into adventure!
pt_pt: Preparámos uma atualização aterradora! Promoção Demoníaca Os monstros marinhos vão morrer de inveja dos novos visuais para K'arkh, Satori e Phobos. Aproveita o desconto atual! Fronteiras abertas Agora tens livre trânsito para transferir a tua conta para outro servidor, desde que seja mais antigo que o teu servidor inicial! O que esperas? Parte à aventura!

source: Good luck, Brave Hero, and remember - we are always here for you: support@herowars.zendesk.com.
pt_pt: Boa sorte, Bravo Herói, e lembra-te! Estamos sempre aqui para ajudar-te, em support@herowars.zendesk.com.

source: Dominate
pt_pt: Vence

source: We completely understand how you feel in such a situation.
pt_pt: Compreendemos a tua situação.

source: Here's a tip: you can skip orders on the Board and wait for the new ones.
pt_pt: Eis uma dica: podes ignorar encomendas na Tabela e esperar que surjam outras.

source: This way, you can only complete the orders of your choice.
pt_pt: Desta forma podes completar apenas as encomendas de que mais gostas.

source: Your browser doesn\'t support flash player version
pt_pt: O teu navegador não é compatível com esta versão do Flash Player

source: We completely understand what you mean — it can get quite challenging exploring the mysterious lands of the island :) Don't forget to use all the means of earning energy!
pt_pt: Pode ser muito desafiante explorar a Ilha :) Não te esqueças de usar todas as formas de ganhar energia!

source: You can create energy in the cauldron, find it in chests on the Island, earn energy from completing boat orders :) Also, reaching a new level fills the energy bar to the max :)
pt_pt: Podes criar energia no caldeirão, encontrá-la em arcas na Ilha ou ganhar energia quando concluis pedidos do barco :) E quando atinges um nível novo, renovas a barra de energia :)

source: Have another account?
pt_pt: Tens outra conta?

source: Start the fall with awesome events, new skins, and valuable trophies!
pt_pt: Entra no outono com eventos fantásticos, novos visuais e troféus!

source: Power, courage, and a pinch of mystery!
pt_pt: Poder, coragem e mistério!

source: Talisman Keepers Get ready for a new event where you can get Talismans for Arachne, Kai, Keira, Markus, Morrigan, Celeste, and Heidi.
pt_pt: Vigias do Talismã Prepara-te para um novo evento, onde podes obter talismãs de Arachne, Kai, Keira, Markus, Morrigan, Celeste e Heidi.

source: Don't miss out on the chance to power-up your favorite Heroes!
pt_pt: Não percas esta oportunidade de melhorar os teus heróis favoritos!

source: Shadows of the Past The freezing wind coming in from the Nightmare Valley is howling the ballad of the Guardians and the Pumpkin King.
pt_pt: Sombras do Passado O vento gélido que sopra do Vale do Pesadelo traz consigo A Balada dos Guardiões e do Rei Abóbora.

source: Muster up your courage and take a deep dive into the dark past of the Dominion!
pt_pt: Enche-te de coragem e mergulha no passado sombrio do Domínio!

source: It's time to face your fears!
pt_pt: Enfrenta os teus medos!

source: YOU'RE FIRED
pt_pt: ESTÁS DESPEDIDO.

source: June Battle Pass!
pt_pt: Passe de Batalha de Junho!

source: Runic Ruckus!
pt_pt: Tumulto Rúnico!

source: Captains Tournament!
pt_pt: Torneio de Capitães!

source: New Guardian in the Dominion!
pt_pt: Novo Guardião no Domínio!

source: Level up
pt_pt: Melhora

source: Sunny Days!
pt_pt: Dias Ensolarados!

source: Free Runes!
pt_pt: Runas grátis!

source: Click the image to get 10 Great Enchantment Runes!
pt_pt: Clica na imagem para obter 10 Runas de Encantamento Excelentes!

source: UNLOCK NEW ABILITIES!
pt_pt: DESBLOQUEIA NOVAS HABILIDADES!

source: Hero Wars is 8 years old!
pt_pt: O Hero Wars faz 8 anos!

source: Celebrate Dominion’s birthday with us!
pt_pt: Celebra o aniversário do Domínio connosco!

source: Play the festive Bingo, complete quests and earn valuable prizes including coins, resources, and chests!
pt_pt: Joga o Bingo festivo, conclui missões e ganha prémios valiosos, incluindo moedas, recursos e baús!

source: Celebrate Hero Wars birthday, play the Bingo and get festive trophies!
pt_pt: Celebra o aniversário do Hero Wars, joga o Bingo e ganha troféus festivos!

source: For eight years our brave heroes have been deterring forces of evil that threaten Dominion!
pt_pt: Há 8 anos que os nossos heróis corajosos detêm as forças do mal que ameaçam o Domínio!

source: There are still many battles ahead, so you need to be well prepared!
pt_pt: Ainda há muitas batalhas pela frente, pelo que precisas de te preparar bem!

source: To make it easier, we've opened the festive shop that is piled with valuable resources.
pt_pt: Para facilitar, abrimos a loja festiva, apinhada de recursos valiosos.

source: Plus, the Bingo mechanic is back in the game on this special occasion!
pt_pt: Além disso, a mecânica do Bingo voltou ao jogo nesta ocasião especial!

source: Complete quests in the squares to get event coins, even more resources, cool chests, and cosmetics!
pt_pt: Conclui as missões nos quadrados para obteres moedas do evento, ainda mais recursos, baús fixes e cosméticos!

source: Grow stronger and more experienced together with your favorite heroes!
pt_pt: Fica mais forte e ganha experiência juntamente com os teus heróis favoritos!

source: A mystic update!
pt_pt: Uma atualização mística!

source: Step to the other side Plunge into a seething witch's cauldron and enter the world of themed quests and valuable trophies!
pt_pt: Passa para o outro lado Mergulha no caldeirão fervente de uma bruxa e entra no mundo de missões temáticas e troféus valiosos!

source: Earn event coins, improve Heroes of Eternity Way and upgrade Octavia’s star rank.
pt_pt: Ganha moedas do evento, melhora os Heróis do Caminho da Eternidade e atualiza a classificação por estrelas de Octavia.

source: Don't miss out on exclusive festive frames and avatars, many great offers for useful resources, and opportunities to get some additional Battle Pass points!
pt_pt: Não percas molduras e avatares festivos exclusivos, muitas excelentes ofertas para recursos úteis e oportunidades de obteres alguns pontos adicionais do Passe de Batalha!

source: It's going to be wickedly fun!
pt_pt: Vai ser terrivelmente divertido!

source: Join the celebration and stock up on resources!
pt_pt: Junta-te à celebração e reabastece-te de recursos!

source: Get Soul Stones for the Heroes of the Way of Eternity, guild bundles, a new frame and a colorful avatar!
pt_pt: Obtém Pedras Anímicas para os Heróis do Caminho da Eternidade, pacotes de guilda, uma nova moldura e um avatar colorido!

source: Celebrate Halloween in Dominion and save up to 55%!
pt_pt: Celebra o Halloween no Domínio e poupa até 55%!

source: On this day, even the most fearless of Heroes aren't ashamed to get a little scared...
pt_pt: Neste dia, nem o mais destemido dos Heróis tem vergonha de ficar um bocadinho assustado...

source: Join the spooky celebration, complete special quests and spend the coins that you earn in the event shop.
pt_pt: Junta-te à celebração assustadora, conclui missões especiais e gasta as moedas que ganhas na loja do evento.

source: Save up to 55% and get 4 times as many resources for each purchase during the 4-day sale!
pt_pt: Poupa até 55% e obtém até 4 vezes de recursos por cada compra durante a promoção de 4 dias!

source: Don't miss out on an opportunity to get Soul Stones for the Heroes of the Way of Eternity, guild bundles, a new frame and a colorful avatar.
pt_pt: Não percas a oportunidade de obteres Pedras Anímicas para os Heróis do Caminho da Eternidade, pacotes de guilda, uma nova moldura e um avatar colorido.

source: Let nightmares become your allies!
pt_pt: Deixa que os pesadelos se tornem teus aliados!

source: Defeat the beast!
pt_pt: Derrota o monstro!

source: Slay and loot!
pt_pt: Elimina e saqueia!

source: A celebratory update!
pt_pt: Atualização festiva!

source: Hero Wars is 8 years old Celebrate the game’s birthday with us!
pt_pt: O Hero Wars faz 8 anos Celebra o aniversário connosco!

source: Play Bingo and complete event quests to get unique prizes: an avatar, a frame, and many valuable trophies.
pt_pt: Joga Bingo e conclui missões para obteres prémios únicos: avatar, moldura e muitos troféus valiosos.

source: New talismans Get powerful talismans for your favorite Heroes!
pt_pt: Novos talismãs Obtém talismãs poderosos para os teus Heróis favoritos!

source: These rare artifacts will help Aurora, Galahad, Dorian, Lian, Morrigan, and Fafnir prepare for battles to come.
pt_pt: Estes artefactos raros ajudarão Aurora, Galahad, Dorian, Lian, Morrigan e Fafnir a prepararem-se para as próximas batalhas.

source: Use them to make your team stronger at this special time!
pt_pt: Utiliza-os para fortalecer a tua equipa nesta época especial!

source: Enjoy the celebrations even better with glorious victories!
pt_pt: Desfruta ainda mais das celebrações com vitórias gloriosas!

source: COLLECT EPIC HEROES
pt_pt: COLECIONA HERÓIS ÉPICOS

source: SLAY BOSSES!
pt_pt: DERROTA BOSSES!

source: ENDLESS HERO CHOICES!
pt_pt: ESCOLHAS DE HERÓIS INFINITAS!

source: FIGHT IN PVP
pt_pt: LUTA EM PVP

source: Ninja Turtles in Dominion!
pt_pt: Tartarugas Ninja no Domínio!

source: An incredible adventure awaits!
pt_pt: Uma aventura incrível aguarda-te!

source: The legendary four will team up with the Guardians to save Strongford from imminent danger.
pt_pt: As quatro lendárias tartarugas vão fazer equipa com os Guardiões para salvar Strongford de perigo iminente.

source: Explore new locations in the capital of Dominion, make your way through crowds of cunning enemies, and earn cool thematic trophies!
pt_pt: Explora novas localizações na capital de Domínio, abre caminho por entre multidões de inimigos astuciosos e ganha troféus temáticos fixes!

source: Don't miss this unique chance to add Ninja Turtles to your team forever!
pt_pt: Não percas esta oportunidade única de adicionares as Tartarugas Ninja à tua equipa para sempre!

source: Pre-order Ninja Turtles!
pt_pt: Pré-encom. Tartarugas Ninja!

source: Now is your chance: add Ninja Turtles to the team!
pt_pt: A tua chance: adicionar Tartarugas Ninja à equipa!

source: Pre-order now to receive a Hero with three stars, a frame and an avatar during the event from December 2 to December 22!
pt_pt: Pré-encomenda agora e recebe um Herói com três estrelas, uma moldura e um avatar no evento entre 2 e 22 de dezembro!

source: Pre-order an iconic Hero from Teenage Mutant Ninja Turtles!
pt_pt: Pré-encomenda um Herói icónico das Tartarugas Ninja Mutantes Adolescentes!

source: Young talents are on their way to help you defeat evil and make pizza the hottest trend in Dominion!
pt_pt: Jovens talentos vão a caminho de ajudar-te a derrotar o mal e fazer da pizza a tendência mais escaldante em Domínio!

source: You can receive a legendary Hero from the Teenage Mutant Ninja Turtles by taking part in the event from December 2 to December 22.
pt_pt: Podes receber um Herói lendário das Tartarugas Ninja Mutantes Adolescentes participando no evento entre 2 de dezembro e 22 de dezembro.

source: But if you pre-order, you'll receive a Hero with three stars plus an exclusive frame and an avatar as a stylish bonus!
pt_pt: Mas se pré-encomendares, receberás um Herói com três estrelas mais uma moldura exclusiva e um avatar como bónus cheio de estilo!

source: Master the most difficult ninjutsu techniques and make your enemies suck some lemons!
pt_pt: Domina as técnicas de ninjútsu mais difíceis e põe os teus inimigos de cabeça às voltas!

source: Log in every day in December and get Soul Stones for Rufus!
pt_pt: Inicia sessão todos os dias em dezembro e recebe Pedras Anímicas para o Rufus!

source: Log in every day in December and get Soul Stones for the fearless and merry drunkard to make him even stronger!
pt_pt: Inicia sessão todos os dias em dezembro e recebe Pedras Anímicas para tornares ainda mais forte esta destemida, alegre e ébria personagem!

source: Rush into adventure with legendary Heroes!
pt_pt: Corre para a aventura com Heróis lendários!

source: All for one: four Ninja Turtles in one Hero.
pt_pt: Tudo em um: 4 Tartarugas Ninja num só Herói.

source: Now is your chance to receive a new unique Guardian and make them stronger!
pt_pt: Já tens a oportunidade de receber um Guardião único e torná-lo mais forte!

source: An adventure with legendary Ninja Turtles awaits!
pt_pt: Uma aventura com as lendárias Tartarugas Ninja está à tua espera!

source: The iconic Ninja Turtles have arrived in Dominion!
pt_pt: As Tartarugas Ninja chegaram ao Domínio!

source: The famous pizza lovers teamed up as one Hero of the Way of Nature!
pt_pt: As famosas amantes de pizza juntaram-se como um Herói do Caminho da Natureza!

source: Join them in an adventure and alternate between all four Ninja Turtles' talents to win!
pt_pt: Junta-te a elas numa aventura e alterna entre os talentos das 4 Tartarugas Ninja para ganhar!

source: Enjoy five new maps with unique locations, exclusive skins, and thematic avatars and frames.
pt_pt: Desfruta de 5 novos mapas com localizações únicas, visuais exclusivos, avatares e molduras temáticos.

source: Moreover, after you've summoned Ninja Turtles in the event, you'll still be able to upgrade them even when the event ends!
pt_pt: Além disso, após teres invocado as Tartarugas Ninja no evento, continuarás a poder melhorá-las mesmo quando o evento terminar!

source: Show your enemies the true turtle power!
pt_pt: Mostra aos inimigos o verdadeiro poder de tartaruga!

source: Hero of the Month:
pt_pt: Herói do mês:

source: Make the great Guardian even stronger!
pt_pt: Torna o grande Guardião ainda mais forte!

source: Log in every day in December and get Soul Stones for the fearless and merry drunkard Rufus!
pt_pt: Inicia sessão todos os dias em dezembro e recebe Pedras Anímicas para o destemido, alegre e ébrio Rufus!

source: Could a common tavern patron really become one of the Guardians of Dominion?
pt_pt: Será que um comum dono de uma taberna pode mesmo tornar-se num dos Guardiões do Domínio?

source: Yes, if you're as witty as Rufus!
pt_pt: Sim, se fores tão espirituoso como o Rufus!

source: Having confined Rakashi the demon within his shield, Rufus skillfully protects allies from the enemy spells!
pt_pt: Tendo confinado o demónio Rakashi com o seu escudo, o Rufus protege habilmente os seus aliados contra os feitiços dos inimigos!

source: Autumn Gifts Autumn generously bestows gifts upon Heroes!
pt_pt: Presentes de outono O outono dá, generosamente, presentes aos Heróis!

source: Complete quests, collect coins, and try your luck at finding rare artifacts.
pt_pt: Conclui missões, recolhe moedas e tenta a tua sorte a encontrar artefactos raros.

source: And, of course, check special offers in the shop: you can get legendary resourses for great prices for a limited time only!
pt_pt: E, claro, vê as ofertas específicas na loja: podes obter recursos lendários por preços fantásticos, mas apenas durante um período de tempo limitado!

source: Upgrade Heroes of the Way of Chaos and get them ready for the battles to come.
pt_pt: Atualiza os Heróis do Caminho do Caos e prepara-os para as batalhas que se seguem.

source: May this season's gifts show you the road to greatness!
pt_pt: Que os presentes desta época te mostrem o caminho para a grandeza!

source: TMNT Joins the Fantasy Battle!
pt_pt: TMNT na batalha de fantasia!

source: TMNT Awaits you in PvP Arena!
pt_pt: TMNT esperam-te na Arena PvP!

source: Team up with Ninja Turtles and explore epic challenges!
pt_pt: Junta-te às Tartarugas Ninja e explora desafios épicos!

source: Collect heroes, win arena battles and epic wars!
pt_pt: Coleciona heróis e vence batalhas e guerras épicas!

source: The Ultimate Crossover!
pt_pt: o crossover definitivo!

source: Join forces with the Ninja Turtles, upgrade legendary heroes, and dominate the PvP arena.
pt_pt: Une forças com as Tartarugas Ninja, melhora heróis lendários e domina a arena PvP.
